In [6]:
import pandas as pd
df = pd.read_csv('data.csv',nrows =5)
df

    Name  Age        Add       Phone
0    Ram   34  Kathmandu  9863123654
1  Shyam   45  Bhaktapur  9841845652
2   Hari   25   Lalitpur  9867234565
3   Sita   26      Jhapa  9852036545
4   Gita   28     Banepa  9861258456

In [12]:
df = pd.read_csv('data.csv')
df.head(3)

    Name  Age        Add       Phone
0    Ram   34  Kathmandu  9863123654
1  Shyam   45  Bhaktapur  9841845652
2   Hari   25   Lalitpur  9867234565

In [14]:
df.tail(3)

    Name  Age      Add       Phone
3   Sita   26    Jhapa  9852036545
4   Gita   28   Banepa  9861258456
5  Nabin   30  Lumbini  9808235698

In [28]:
row,col = df.shape
print(row)
print(col)

6
3

In [30]:
df = pd.read_csv('data.csv',usecols = ['Name','Phone'])
df

    Name       Phone
0    Ram  9863123654
1  Shyam  9841845652
2   Hari  9867234565
3   Sita  9852036545
4   Gita  9861258456
5  Nabin  9808235698

In [40]:
df = pd.read_csv('data.csv')
df[['Name','Phone']]

    Name       Phone
0    Ram  9863123654
1  Shyam  9841845652
2   Hari  9867234565
3   Sita  9852036545
4   Gita  9861258456
5  Nabin  9808235698

In [42]:
#iloc

In [48]:
df = pd.read_csv('data.csv')
df.iloc[0:4]

    Name  Age        Add       Phone
0    Ram   34  Kathmandu  9863123654
1  Shyam   45  Bhaktapur  9841845652
2   Hari   25   Lalitpur  9867234565
3   Sita   26      Jhapa  9852036545

In [56]:
df.iloc[0:4,0:3]

    Name  Age        Add
0    Ram   34  Kathmandu
1  Shyam   45  Bhaktapur
2   Hari   25   Lalitpur
3   Sita   26      Jhapa

In [64]:
df['Add']

0    Kathmandu
1    Bhaktapur
2     Lalitpur
3        Jhapa
4       Banepa
5      Lumbini
Name: Add, dtype: object

In [66]:
df['Add'] == 'Kathmandu'

0     True
1    False
2    False
3    False
4    False
5    False
Name: Add, dtype: bool

In [68]:
df[df['Add'] == 'Kathmandu']

  Name  Age        Add       Phone
0  Ram   34  Kathmandu  9863123654

In [74]:
df[(df['Add'] == 'Kathmandu') | (df['Age']>40)]

    Name  Age        Add       Phone
0    Ram   34  Kathmandu  9863123654
1  Shyam   45  Bhaktapur  9841845652

In [80]:
df[(df['Add'] == 'Kathmandu') & (df['Age']>20)]

  Name  Age        Add       Phone
0  Ram   34  Kathmandu  9863123654

In [1]:
import pandas as pd
df = pd.read_csv('data.csv')
df

    Name  Age        Add       Phone
0    Ram   34  Kathmandu  9863123654
1  Shyam   45  Bhaktapur  9841845652
2   Hari   25   Lalitpur  9867234565
3   Sita   26      Jhapa  9852036545
4   Gita   28     Banepa  9861258456
5  Nabin   30    Lumbini  9808235698

In [9]:
#save to csv file
df = df[df['Add'] == 'Kathmandu']
df.to_csv('filter_data.csv')

In [11]:
#save to json
df.to_json('filter_data.json')

In [13]:
#to read json
df = pd.read_json('filter_data.json')
df

  Name  Age        Add       Phone
0  Ram   34  Kathmandu  9863123654

In [17]:
# list inside list to csv
import csv
data = [['Name','Age','Add'],
       ['Ram',34,'Kathmandu'],
        ['Shyam',45,'Bhaktapur'],
        ['Hari',45,'Lalitpur']]
file = open('list_data.csv','w')
x = csv.writer(file)
x.writerows(data)
file.close()

In [19]:
df = pd.read_csv('list_data.csv')
df

    Name  Age        Add
0    Ram   34  Kathmandu
1  Shyam   45  Bhaktapur
2   Hari   45   Lalitpur

In [23]:
import pandas as pd
data = [['Ram',34,'Kathmandu'],
        ['Shyam',45,'Bhaktapur'],
        ['Hari',45,'Lalitpur']]
df = pd.DataFrame(data, columns =['name','age','add'])
df.to_csv('list_data.csv')

In [37]:
#list inside dict to csv file
data = {
    'sn':[1,2,3],
    'name':['Ram','Shyam','Hari'],
    'age':[34,56,34],
    'address':['Kathmandu','Bhaktapur','Lalitpur']
}
df = pd.DataFrame(data)
df.to_csv('list_data.csv')

In [39]:
df = pd.read_csv('list_data.csv',index_col = 'sn')
df

    Unnamed: 0   name  age    address
sn
1            0    Ram   34  Kathmandu
2            1  Shyam   56  Bhaktapur
3            2   Hari   34   Lalitpur

In [43]:
import csv
with open('data.csv') as csvfile:
    reader = csv.DictReader(csvfile)
    for row in reader:
        print(row)

{'Name': 'Ram', 'Age': '34', 'Add': 'Kathmandu', 'Phone': '9863123654'}
{'Name': 'Shyam', 'Age': '45', 'Add': 'Bhaktapur', 'Phone': '9841845652'}
{'Name': 'Hari', 'Age': '25', 'Add': 'Lalitpur', 'Phone': '9867234565'}
{'Name': 'Sita', 'Age': '26', 'Add': 'Jhapa', 'Phone': '9852036545'}
{'Name': 'Gita', 'Age': '28', 'Add': 'Banepa', 'Phone': '9861258456'}
{'Name': 'Nabin', 'Age': '30', 'Add': 'Lumbini', 'Phone': '9808235698'}

In [45]:
import csv
with open('data.csv') as csvfile:
    reader = csv.DictReader(csvfile)
    print([ i for i in reader])

[{'Name': 'Ram', 'Age': '34', 'Add': 'Kathmandu', 'Phone': '9863123654'}, {'Name': 'Shyam', 'Age': '45', 'Add': 'Bhaktapur', 'Phone': '9841845652'}, {'Name': 'Hari', 'Age': '25', 'Add': 'Lalitpur', 'Phone': '9867234565'}, {'Name': 'Sita', 'Age': '26', 'Add': 'Jhapa', 'Phone': '9852036545'}, {'Name': 'Gita', 'Age': '28', 'Add': 'Banepa', 'Phone': '9861258456'}, {'Name': 'Nabin', 'Age': '30', 'Add': 'Lumbini', 'Phone': '9808235698'}]

In [59]:
#removing or droping column
df = pd.read_csv('list_data.csv',index_col = 'sn')
df.drop('Unnamed: 0', axis =1,)
# df.drop('Unnamed: 0', axis =1,inplace = True)

     name  age    address
sn
1     Ram   34  Kathmandu
2   Shyam   56  Bhaktapur
3    Hari   34   Lalitpur

In [57]:
df = pd.read_csv('list_data.csv',index_col = 'sn')
df.drop([1,3], axis =0) #removing row

    Unnamed: 0   name  age    address
sn
2            1  Shyam   56  Bhaktapur